Autodesk.Revit.DB.DirectContext3D.VertexFormatBits
Vertex format (i.e., the type of data associated with a vertex) represented as a number.
Remarks:
VertexFormatBits can be used to specify the vertex format in the creation of the following objects:
Autodesk::Revit::DB::DirectContext3D::EffectInstance
Autodesk::Revit::DB::DirectContext3D::VertexFormat
VertexFormatBits is not to be confused with VertexFormat. The latter type of object is associated with low-level graphics
functionality and may become invalid. VertexFormat is needed to submit a set of vertex and index buffers for rendering (see
Autodesk::Revit::DB::DirectContext3D::DrawContext).
Since:
2017